Autodesk.Revit.DB.PolylineSegments.GetVertices
Returns an array of vertices of the polyline segments.
Returns:
Array of XYZ points.
Since:
2016

Autodesk.Revit.DB.PolylineSegments.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PolylineSegments.LineProperties
Access to the line (pen) properties of the polyline
Since:
2016

Autodesk.Revit.DB.PolylineSegments.IsFilled
Indicates whether the area enclosed by the polyline is to be filled or not.
Since:
2016

Autodesk.Revit.DB.PolylineSegments.EndLocalParameter
Local parameter associated with the end point.
Since:
2016

Autodesk.Revit.DB.PolylineSegments.StartLocalParameter
Local parameter associated with the start point.
Since:
2016

Autodesk.Revit.DB.PolylineSegments.EndParameter
Parameter associated with the end point.
Since:
2016

Autodesk.Revit.DB.PolylineSegments.StartParameter
Parameter associated with the start point.
Since:
2016

Autodesk.Revit.DB.PolylineSegments
An output node that represents a tessellated polyline segments.
Remarks:
See also: Autodesk::Revit::DB::IModelExportContext::OnPolylineSegments.
Since:
2016